# ProgressDlgHasCancel

## Description
Determine if the dialog has been canceled. The dialog must have cancelation enabled when created.

```pascal
FUNCTION ProgressDlgHasCancel : BOOLEAN;
```

```python

def vs.ProgressDlgHasCancel():
    return BOOLEAN
```

## Version
Availability: from Vectorworks 2015
## Category
* Utility